Group By

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Category': ['A', 'B', 'A', 'B' ,'A', 'B', 'A', 'B'],
    'Store' : ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2','S1'],
    'Sales': [100,200,150,250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods = 8)
}
df = pd.DataFrame(data)

In [3]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [4]:
# sum of category A sales and sum of category B sales
cat = df.groupby('Category')
for i , v in cat:
    print(i)
    print(v)

A
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
7        B    S1    300        25 2023-01-08

In [5]:
cat = df.groupby('Category')['Sales'].sum()
cat

Category
A    570
B    930
Name: Sales, dtype: int64

In [6]:
cat = df.groupby('Store')['Sales'].sum()
cat

Store
S1    720
S2    780
Name: Sales, dtype: int64

Aggregation

In [7]:
df['Sales'].mean()
# mean
# median
# min
# max
# count

np.float64(187.5)

In [8]:
df['Sales'].agg(['sum' , 'mean', 'min' ,'count' ])

sum      1500.0
mean      187.5
min       100.0
count       8.0
Name: Sales, dtype: float64

Pivot Tables

In [9]:
import numpy as np
import pandas as pd

In [10]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South',
               'East', 'West', 'North', 'South',
               'East', 'West', 'North', 'South',
               'East', 'West', 'North', 'South',
               'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice',
            'John', 'Mary', 'Bob', 'Alice',
            'John', 'Mary', 'Bob', 'Alice',
            'John', 'Mary', 'Bob', 'Alice',
            'John', 'Mary', 'Bob', 'Alice']
}
df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    795     61   John  January      Q1
1  2023-01-02       B   West    587     50   Mary  January      Q1
2  2023-01-03       C  North    561     74    Bob  January      Q1
3  2023-01-04       D  South    737     60  Alice  January      Q1
4  2023-01-05       A   East    308     38   John  January      Q1
5  2023-01-06       B   West    109     25   Mary  January      Q1
6  2023-01-07       C  North    886     66    Bob  January      Q1
7  2023-01-08       D  South    391     52  Alice  January      Q1
8  2023-01-09       A   East    539     70   John  January      Q1
9  2023-01-10       B   West    405     54   Mary  January      Q1
10 2023-01-11       C  North    875     36    Bob  January      Q1
11 2023-01-12       D  South    327     62  Alice  January      Q1
12 2023-01-13       A   East    155     50   John  January      Q1
13 2023-01-14       B   West    567     98   Mary  January      Q1
14 2023-01-15       C  North    420     32    Bob  January      Q1
15 2023-01-16       D  South    823     17  Alice  January      Q1
16 2023-01-17       A   East    806     76   John  January      Q1
17 2023-01-18       B   West    829     13   Mary  January      Q1
18 2023-01-19       C  North    960     41    Bob  January      Q1
19 2023-01-20       D  South    259     78  Alice  January      Q1

In [11]:
 pd.pivot_table(df, values = 'Sales', index ='Region' , columns ='Product', aggfunc = 'median')

Product      A      B      C      D
Region
East     539.0    NaN    NaN    NaN
North      NaN    NaN  875.0    NaN
South      NaN    NaN    NaN  391.0
West       NaN  567.0    NaN    NaN

In [12]:
 pd.pivot_table(df, values = ['Sales', 'Units'], index ='Region' , columns ='Product')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     520.6    NaN    NaN    NaN  59.0   NaN   NaN   NaN
North      NaN    NaN  740.4    NaN   NaN   NaN  49.8   NaN
South      NaN    NaN    NaN  507.4   NaN   NaN   NaN  53.8
West       NaN  499.4    NaN    NaN   NaN  48.0   NaN   NaN

Cross Tabs

In [13]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    795     61   John  January      Q1
1  2023-01-02       B   West    587     50   Mary  January      Q1
2  2023-01-03       C  North    561     74    Bob  January      Q1
3  2023-01-04       D  South    737     60  Alice  January      Q1
4  2023-01-05       A   East    308     38   John  January      Q1
5  2023-01-06       B   West    109     25   Mary  January      Q1
6  2023-01-07       C  North    886     66    Bob  January      Q1
7  2023-01-08       D  South    391     52  Alice  January      Q1
8  2023-01-09       A   East    539     70   John  January      Q1
9  2023-01-10       B   West    405     54   Mary  January      Q1
10 2023-01-11       C  North    875     36    Bob  January      Q1
11 2023-01-12       D  South    327     62  Alice  January      Q1
12 2023-01-13       A   East    155     50   John  January      Q1
13 2023-01-14       B   West    567     98   Mary  January      Q1
14 2023-01-15       C  North    420     32    Bob  January      Q1
15 2023-01-16       D  South    823     17  Alice  January      Q1
16 2023-01-17       A   East    806     76   John  January      Q1
17 2023-01-18       B   West    829     13   Mary  January      Q1
18 2023-01-19       C  North    960     41    Bob  January      Q1
19 2023-01-20       D  South    259     78  Alice  January      Q1

In [14]:
pd.crosstab(df['Region'], df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

Operations

In [15]:
import numpy as np
import pandas as pd

In [16]:
df1 = pd.DataFrame({
    'A' : [1,2,3,4,5],
    'B' : [10,20,30,40,50],
    'C' : [100, 200, 300 ,400 ,500]
})
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [17]:
df1.shape

(5, 3)

In [18]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [19]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [20]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [21]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

Applying some functions

In [22]:
def square(x):
    return x ** 2

In [25]:
df1['D'] = df1['B'].apply(square)
df1

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500

In [ ]:
df1['E'] = df1[D].apply(lambd)